app/controllers/parking_area_controller.rb

SELECT `parking_areas`.* FROM `parking_areas` ORDER BY `parking_areas`.`id` ASC LIMIT 1
INSERT INTO `parking_areas` (`capacity`, `created_at`, `updated_at`) VALUES (6, '2014-08-16 06:09:20', '2014-08-16 06:09:20')
UPDATE `parking_areas` SET `capacity` = 5, `updated_at` = '2014-08-16 06:21:51' WHERE `parking_areas`.`id` = 1
---
  def create
    response = if ParkingArea.all.blank?
      ParkingArea.create(:capacity => params[:slot])
    else
      ParkingArea.update(ParkingArea.first.id, :capacity => params[:slot])